Narrator
The Hotel room was moldy and small. Hollus could barely use the little dinner table to clean his gun.

Hollus
What are you writing? We’re five hours away from the damn thing. 

Thatcher
I’m a hostage right? I should have a story written to prove I was working. 

Hollus
I’m no computer guy but I’m pretty sure your computer will tell on you. 

Thatcher
That's where you change the time and take it off wifi. Stick with wife killing I’ll stick with computers. 

Hollus
I’m just saying that’s all. You bring any good food with you? I’m getting a bit hungry. 

Thatcher
Yeah I got Ramen from the vending machine outside. I figured your last meal should include some MSG.  

Hollus
That's awfully kind of you. 

Thatcher
Southern manners. You want that now? Give’s me something to do besides look at my screen.  

Hollus
Yeah I guess, did you get any seasonings for it?

Thatcher
Uh, they got some salt and pepper. 

Hollus
Could I get some pepper for that?

Thatcher
Of course, you’re a kidnapper and a connoisseur. 

Narrator
Thatcher took out his mini stove and began to cook.

Hollus
You really don’t have an issue with this? I mean I know you're a journalist but still. 

Thatcher
Yeah I mean I’m not big on you killing your wife, but you're gonna do it no matter what right? 

Hollus
Yep.

Thatcher
See! So what’s the hurt in tagging along? 

Hollus
I could see that. You have to admit though it’s a strange mentality. 

Thatcher
As much as killing your wife is I imagine. 

Hollus
You're watching the whole thing, getting rich off it. How removed are you from me in that case. Hell! You're making my final meal.  

Thatcher
Maybe being moral beings isn’t our best strong suit. Now eating I can agree with you on. 

Narrator
Hollus cleared his table for his Ramen. 

Hollus
What’s the plan? 

Thatcher
For what? 

Hollus
After I’m dead. 

Thatcher
Well probably after my lengthy press tour, a multi million dollar netflix deal, and tie in book deal. Politics. I could make a decent senator. 

Hollus
You got the moral compass of one. What’s the story for your wife? You're gonna tell her the truth? 

Thatcher
No, I love her too much to do that

Hollus
You should tell her, secrets tear up a marriage. Even something big like this could sneak in and ruin everything. 

Thatcher
Personal experience? 

Hollus
I cheated on her. Back in the first year of our marriage, I thought I had a pass since we were fighting every day. Then Fred was born and he just glued us together. Some days I forgot what I did. Others I told myself never again. Then of course I tell her one night years after Fred left the house. Oh! It was a dumb fight, something about her sister staying at the house. She starts talking about my failed gold business and my depression and I just needed to hurt her. So I screamed at her about cheating on her. And I can’t tell you how quickly I wanted to die right there. I wanted, no, I needed God to take me away from her. He didn’t and then I lost everything. 

Hollus
It wasn’t quick; it was years of losing fancy cars and pets to gambling. She never took a cent from me but she still found a way to take my life away. She kept growing and finding her best life. I never felt happy since. Gosh! She just rebounded like I was a small part of her life. I just loved her so much! How could she, just drop me?’ 

Thatcher
I don’t know. Funny how it works out like that.  

Hollus
No one prepared me for this. No booklet or talk. How is a man supposed to relearn to walk at sixty? I thought I was done, my path was set you know? 

Thatcher
Why take her with you? Why not just go out by yourself?  

Hollus
And let her win? 